<img src="https://i.imgur.com/jDiLGFC.jpg">
You are given the following <a href="https://raw.githubusercontent.com/erood/interviewqs.com_code_snippets/master/Datasets/ddi_baby_names.csv">dataset</a>, containing information on baby names from the <a href="https://www.ssa.gov/oact/babynames/">U.S. Social Security Administration</a>.

Using the dataset, write code to find the following:

- Number of unique names across the dataset, split by both # of unique male/female names
- Top 10 most popular male and female names, along with their associated counts
- The top 10 most trending names (% growth) from 2010+, with an associated plot to show the relative growth between names
<br>

In [2]:
# Here is code to pull the dataset and relevant libraries 
# into a Google Colab or Jupyter notebook to help get you started
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
baby_names = pd.read_csv("https://raw.githubusercontent.com/erood/interviewqs.com_code_snippets/master/Datasets/ddi_baby_names.csv")
baby_names.head()

   year       name gender  count
0  1880       Mary      F   7065
1  1880       Anna      F   2604
2  1880       Emma      F   2003
3  1880  Elizabeth      F   1939
4  1880     Minnie      F   1746

## Number of unique names across the dataset, split by both # of unique male/female names

In [19]:
# Number of unique male names
len(baby_names['name'].where(baby_names['gender'].str.contains('M')).dropna().unique())

41475

In [32]:
# Number of unique female names
len(baby_names['name'].where(baby_names['gender'].str.contains('F')).dropna().unique())

67698

## Top 10 most popular male and female names, along with their associated counts

In [34]:
# Initial attempt. Note that there are many of the same name but the year is different
# I assume that I'm counting overall popularity since year was not specified in prompt
baby_names.sort_values(by='count', ascending = False).where(baby_names['gender'].str.contains('M')).dropna().head(10)

          year     name gender    count
437169  1947.0    James      M  94757.0
544630  1957.0  Michael      M  92704.0
437170  1947.0   Robert      M  91640.0
533165  1956.0  Michael      M  90656.0
556204  1958.0  Michael      M  90517.0
447478  1948.0    James      M  88584.0
510812  1954.0  Michael      M  88528.0
521887  1955.0  Michael      M  88327.0
437171  1947.0     John      M  88319.0
427047  1946.0    James      M  87436.0

In [66]:
# Making new dataframe consisting of most popular names regardless of year
# Top 10 most popular male names overall
male_names = baby_names.where(baby_names['gender'].str.contains('M'))
male_names.groupby(['name', 'gender']).agg({'count': 'sum'}).sort_values(by='count',ascending = False).head(10)

                    count
name    gender
James   M       5164280.0
John    M       5124817.0
Robert  M       4820129.0
Michael M       4362731.0
William M       4117369.0
David   M       3621322.0
Joseph  M       2613304.0
Richard M       2565301.0
Charles M       2392779.0
Thomas  M       2311849.0

In [67]:
# Top 10 most popular female names overall
female_names = baby_names.where(baby_names['gender'].str.contains('F'))
female_names.groupby(['name', 'gender']).agg({'count': 'sum'}).sort_values(by='count',ascending = False).head(10)

                      count
name      gender
Mary      F       4125675.0
Elizabeth F       1638349.0
Patricia  F       1572016.0
Jennifer  F       1467207.0
Linda     F       1452668.0
Barbara   F       1434397.0
Margaret  F       1248985.0
Susan     F       1121703.0
Dorothy   F       1107635.0
Sarah     F       1077746.0

## The top 10 most trending names (% growth) from 2010+, with an associated plot to show the relative growth between names